package com.example.fuproject

public class AllName{
    companion object{




        @JvmField
        val firstName="赵钱孙李周吴郑王" +
                "冯陈褚卫蒋沈韩杨" +
                "朱秦尤许何吕施张" +
                "孔曹严华金魏陶姜" +
                "戚谢邹喻柏水窦章" +
                "云苏潘葛奚范彭郎" +
                "鲁韦昌马苗凤花方" +
                "俞任袁柳酆鲍史唐" +
                "费廉岑薛雷贺倪汤" +
                "滕殷罗毕郝邬安常" +
                "乐于时傅皮卞齐康" +
                "伍余元卜顾孟平黄" +
                "和穆萧尹姚邵湛汪" +
                "祁毛禹狄米贝明臧" +
                "计伏成戴谈宋茅庞" +
                "熊纪舒屈项祝董梁" +
                "杜阮蓝闵席季麻强" +
                "贾路娄危江童颜" +
                "淳于单于太叔申屠" +
                "公孙仲孙轩辕令狐" +
                "钟离宇文长孙慕容" +
                "鲜于闾丘司徒司空" +
                "丌官司寇仉督子车" +
                "颛孙端木巫马公西" +
                "漆雕乐正壤驷公良" +
                "拓跋夹谷宰父谷梁" +
                "晋楚闫法汝鄢涂钦" +
                "段干百里东郭南门" +
                "呼延归海羊舌微生" +
                "岳帅缑亢况郈有琴" +
                "梁丘左丘东门西门" +
                "商牟佘佴伯赏南宫" +
                "墨哈谯笪年爱阳佟"
        @JvmField
        val secondName=arrayOf(
            "澄邈","德泽","海超","海阳","海荣","海逸","海昌","瀚钰","瀚文","涵亮","涵煦","明宇","涵衍","浩皛","浩波","浩博","浩初","浩宕","浩歌","浩广","浩邈","浩气","浩思","浩言","鸿宝","鸿波","鸿博","鸿才","鸿畅","鸿畴","鸿达","鸿德","鸿飞","鸿风","鸿福","鸿光","鸿晖","鸿朗","鸿文","鸿轩","鸿煊","鸿骞","鸿远","鸿云","鸿哲","鸿祯","鸿志","鸿卓","嘉澍","光济","澎湃","彭泽","鹏池","鹏海","浦和","浦泽","瑞渊","越泽","博耘","德运","辰宇","辰皓","辰钊","辰铭","辰锟","辰阳","辰韦","辰良","辰沛","晨轩","晨涛","晨濡","晨潍","鸿振","吉星","铭晨","起运","运凡","运凯","运鹏","运浩","运诚","运良","运鸿","运锋","运盛","运升","运杰","运珧","运骏","运凯","运乾","维运","运晟","运莱","运华","耘豪","星爵","星腾","星睿","星泽","星鹏","星然","震轩","震博","康震","震博","振强","振博","振华","振锐","振凯","振海","振国","振平","昂然","昂雄","昂杰","昂熙","昌勋","昌盛","昌淼","昌茂","昌黎","昌燎","昌翰","晨朗","德明","德昌","德曜","范明","飞昂","高旻","晗日","昊然","昊天","昊苍","昊英","昊宇","昊嘉","昊明","昊伟","昊硕","昊磊","昊东","鸿晖","鸿朗","华晖","金鹏","晋鹏","敬曦","景明","景天","景浩","俊晖","君昊","昆琦","昆鹏","昆纬","昆宇","昆锐","昆卉","昆峰","昆颉","昆谊","昆皓","昆鹏","昆明","昆杰","昆雄","昆纶","鹏涛","鹏煊","曦晨","曦之","新曦","旭彬","旭尧","旭鹏","旭东","旭炎","炫明","宣朗","学智","轩昂","彦昌","曜坤","曜栋","曜文","曜曦","曜灿","曜瑞","智伟","智杰","智刚","智阳","昌勋","昌盛","昌茂","昌黎","昌燎","昌翰","晨朗","昂然","昂雄","昂杰","昂熙","范明","飞昂","高朗","高旻","德明","德昌","德曜","智伟","智杰","智刚","智阳","瀚彭","旭炎","宣朗","学智","昊然","昊天","昊苍","昊英","昊宇","昊嘉","昊明","昊伟","鸿朗","华晖","金鹏","晋鹏","敬曦","景明","景天","景浩","景行","景中","景逸","景彰","昆鹏","昆明","昆杰","昆雄","昆纶","鹏涛","鹏煊","景平","俊晖","君昊","昆琦","昆鹏","昆纬","昆宇","昆锐","昆卉","昆峰","昆颉","昆谊","轩昂","彦昌","曜坤","曜文","曜曦","曜灿","曜瑞","曦晨","曦之","新曦","鑫鹏","旭彬","旭尧","旭鹏","旭东","浩轩","浩瀚","浩慨","浩阔","鸿熙","鸿羲","鸿禧","鸿信","泽洋","泽雨","哲瀚","胤运","佑运","允晨","运恒","运发","云天","耘志","耘涛","振荣","振翱","中震","子辰","晗昱","瀚玥","瀚昂","瀚彭","景行","景中","景逸","景彰","绍晖","文景","曦哲","永昌","子昂","智宇","智晖","晗日","晗昱","瀚昂","昊硕","昊磊","昊东","鸿晖","绍晖","文昂","文景","曦哲","永昌","子昂","智宇","智晖","浩然","鸿运","辰龙","运珹","振宇","高朗","景平","鑫鹏","昌淼","炫明","昆皓","曜栋","文昂","治汇",
            "恨桃","依秋","依波","香巧","紫萱","涵易","忆之","幻巧","美倩","安寒","白亦","惜玉","碧春","怜雪","听南","念蕾","紫夏","凌旋","芷梦","凌寒","梦竹","千凡","丹蓉","慧贞","思菱","平卉","笑柳","雪卉","南蓉","谷梦","巧兰","绿蝶","飞荷","佳蕊","芷荷","怀瑶","慕易","若芹","紫安","曼冬","寻巧","雅昕","尔槐","以旋","初夏","依丝","怜南","傲菡","谷蕊","笑槐","飞兰","笑卉","迎荷","佳音","梦君","妙绿","觅雪","寒安","沛凝","白容","乐蓉","映安","依云","映冬","凡雁","梦秋","梦凡","秋巧","若云","元容","怀蕾","灵寒","天薇","翠安","乐琴","宛南","怀蕊","白风","访波","亦凝","易绿","夜南","曼凡","亦巧","青易","冰真","白萱","友安","海之","小蕊","又琴","天风","若松","盼菡","秋荷","香彤","语梦","惜蕊","迎彤","沛白","雁彬","易蓉","雪晴","诗珊","春冬","晴钰","冰绿","半梅","笑容","沛凝","映秋","盼烟","晓凡","涵雁","问凝","冬萱","晓山","雁蓉","梦蕊","山菡","南莲","飞双","凝丝","思萱","怀梦","雨梅","冷霜","向松","迎丝","迎梅","雅彤","香薇","以山","碧萱","寒云","向南","书雁","怀薇","思菱","忆文","翠巧","书文","若山","向秋","凡白","绮烟","从蕾","天曼","又亦","从语","绮彤","之玉","凡梅","依琴","沛槐","又槐","元绿","安珊","夏之","易槐","宛亦","白翠","丹云","问寒","易文","傲易","青旋","思真","雨珍","幻丝","代梅","盼曼","妙之","半双","若翠","初兰","惜萍","初之","宛丝","寄南","小萍","静珊","千风","天蓉","雅青","寄文","涵菱","香波","青亦","元菱","翠彤","春海","惜珊","向薇","冬灵","惜芹","凌青","谷芹","雁桃","映雁","书兰","盼香","梅致","寄风","芳荷","绮晴","映之","醉波","幻莲","晓昕","傲柔","寄容","以珊","紫雪","芷容","书琴","美伊","涵阳","怀寒","易云","代秋","惜梦","宇涵","谷槐","怀莲","英莲","芷卉","向彤","新巧","语海","灵珊","凝丹","小蕾","迎夏","慕卉","飞珍","冰夏","亦竹","飞莲","秋月","元蝶","春蕾","怀绿","尔容","小玉","幼南","凡梦","碧菡","初晴","宛秋","傲旋","新之","凡儿","夏真","静枫","芝萱","恨蕊","乐双","念薇","靖雁","菊颂","丹蝶","元瑶","冰蝶","念波","迎翠","海瑶","乐萱","凌兰","曼岚","若枫","傲薇","雅芝","乐蕊","秋灵","凤娇","觅云","依伊","恨山","从寒","忆香","香菱","静曼","青寒","笑天","涵蕾","元柏","代萱","紫真","千青","雪珍","寄琴","绿蕊","荷柳","诗翠","念瑶","兰楠","曼彤","怀曼","香巧","采蓝","芷天","尔曼","巧蕊"
        )
        @JvmField
        val speakNice= arrayOf("这位同事平时工作仔细、认真、负责，不但执行力强，且工作配合度也好，有积极向上的工作心态，能主动协助其他同事工作，并且能按时完成上级领导安排的相关工作",
                "勤恳务实，善于学习，对本职工作兢兢业业，注重个人成长；工作成绩进步大，业绩发展迅速，或有效改进自己的工作方式，从而在工作中收到良好效果；悟性较强，能很快适应新的岗位，在新的业务区域可以立即开展工作；能随时根据工作需要调整工作方法和端正心态，不断反思自己，注重个人成长；能在业余时间精专业务知识，提高工作能力；悟性高，工作认真勤奋，吃苦耐劳，进步很快，在新人中起到了榜样作用。",
            "工作上勤勤恳恳，任劳任怨，认真负责，业务水平也在学习中不断提高，关心同事，非常值得大家学习，新晋社会如此努力难能可贵",
            "这位同事平时工作能将自己的能力充分发挥出来，不仅工作认真、做事效率好，而且上班的纪律也很好，值得各位同事学习。",
            "这位同事工作成绩进步大，悟性较强，能很快适应新的岗位，能随时根据工作需要调整工作方法和端正心态，不断反思自己，能有效改进自己的工作方式，从而在工作中收到良好效果。",
            "这位同事平时工作认真，有高速度、高效率、高质量的工作表现，且在日常生活中能与其他同事团结友爱，互助进取！　　",
            "工作热情高，优秀的人格魅力，美德，的素养较高，对待客户诚信，为公司工作考虑严谨、无处不在，能虚心接受的同事给予忠告，正确；研究进展较快，大多数客户的好评。　　",
            "xxx今年工作成绩进步大，工作认真，业务知识扎实，业绩发展迅速，工作态度端正，遵守公司规章制度，能积极完成公司的任务。　　","、作风严谨，从各方面严格要求自己。生活上不骄不躁，作风严谨，遵章守纪，廉洁自律，不侵占公家一分一厘，不。为人谦虚谨慎，善于听取他人意见，博采众长，不断完善自己。严以律己，宽以待人，尊重领导，团结同志。　　","、优秀的业务水平，为公司创造出较好的企业效益，与同事相处和谐。　　","、这位同事作为搅拌室员工，积极进取，工作成果显著，多次得到该部门班长的好评。　　","、工作认真，负责，对工作认真负责、爱和尊重，服从安排，形象良好，在他自己的认真工作，锐意进取，乐于助人，关心同事，和她的同事，善于合作，起主要作用。　　","、XX全年工作中，钟欣桐作为公司销售部的一名营业人员，她勤劳真诚，敢于面对，睿智进取地努力工作，表现优异。她时刻心系客户交货所需，为厂内争取合理生产时间，积极做好公司内部与客户的桥梁作用，主动配合各项管理工作值得我们学习。　　","、XXX同志来公司工作X年多的时间里，一直保持着勤奋、主动的工作作风，能够自觉遵守公司的各项规定和要求，积极协助并较好的完成部门交给的各项工作任务，与同事的关系也比较融洽，责任心比较强，在工作中取得了一定的成绩，得到了同事们的认可和好评。　　","、该同事今年工作成绩进步大，工作认真，业务知识扎实，业绩发展迅速，工作态度端正，遵守公司规章制度，能积极完成公司的任务。　　","、这位同事积极向上，配合度好，平时工作表现很努力，在工作时能以认真、仔细、负责的心态做好自己的工作。　　","、工作认真负责，积极主动，服从整体安排，爱岗敬业，业务知识扎实，业务水平优秀，与北区各位经理相处融洽，树立榜样，胜任北区大区经理工作；人品端正做事塌实行为规范对待所负责区域进行有效指导，并提出建设性意见；高度敬业，表现出色。　　",
            "工作成绩进步大，悟性较强，能很快适应新的岗位，能随时根据工作需要调整工作方法和端正心态，不断反思自己，注重个人成长，能有效改进自己的工作方式，从而在工作中收到良好效果。　　","、在对待本职工作勤勤恳恳、一丝不苟的同时，该同志还积极参与团市委各项中心工作和大型活动，从不敷衍了事，不摆花架子，不搞形式主义，总是从实际出发，尽己所能，不断创新。为团市委各项大型活动的成功举办立下了汗马功劳。　　","、对技术问题有独立见解，虽然想法和思路有明显的书本痕迹，相信经过半年一年的时间思路会更加清晰。唯实践经验不足，需足够谦虚和关注细节。　　","、工作认真，负责；工作认真负责，爱岗敬业，服从整体安排，形象良好；对本职工作兢兢业业，锐意进取，乐于助人，关心同事，与同事相处融洽，善于合作，起带头作用。　　","、良好的个人形象和素养，专业技能或业务水平优秀，为公司利益不计个人得失，对本职工作兢兢业业，锐意进取，为公司员工树立良好形象并起到带头作用；为公司创造出较好的企业效益或社会效益。　　","、员工热爱本职工作，作风正派，团结同事，善于管理。带领全体人员严格执行《锅炉安全操作规程》进行操作，努力降低原燃料消耗，出色完成了全年工作任务。未发生过违纪现象，消防事故和工伤事故为零，设备完好率%。特别是在节能环保工作中，他作出了一定的贡献。　　、望各位同事以以上人员为榜样，在今后的工作中，把自身的发展与公司的发展有机的结合在一起，一起创造公司辉煌的明天！　　、该员工对工作认真负责，服从领导安排，主动配合车间的现场管理。有一定的成本节约意识，自觉自愿先用散装纱和纱头、纱尾，始终保持机边卫生、整洁。个人的生产技术熟练，全年产量高，次布率低，用针少，多次荣获月度生产明星。　　、xxx同志服从上级安排，按时完成生产任务。能够以身作则、身先士卒，发挥了领头羊的作用。他在用人留人方面具有一定的经验，具有一定的沟通技巧，为车间员工队伍的稳定做出了成绩。在他的领导下，班组生产效率提高，所织疵片最少，受到部门员工的一致好评。　　、好的个人形象和素养，专业技能或业务水平优秀，为公司利益不计个人得失，对本职工作兢兢业业，锐意进取，为公司员工树立良好形象并起到带头作用；为公司创造出较好的企业效益或社会效益。　　、该同志在工作中态度认真，积极向上，为人乐观，自我检讨能力较强，思想态度端正，发现本组员工有思想问题时，能主动谈心进行疏导，在他的带领下，顺利完成了旺季时繁重的生产任务，在沟通和思想疏导方面有相当的经验，为部门员工队伍的稳定发挥了作用，促进了生产的有序进行。　　、工作认真刻苦，服务态度非常好，使经理在XXXXX的时候没有后顾之忧；工作积极，热情周到，有一定的领导能力，专业技能业务水平优秀，业务水平也在不断提高，关心每一位合鑫人，是我们大家学习的榜样；能胜任本职工作，爱岗敬业、乐于助人，与同事相处融洽，服从整体安排，对本职工作兢兢业业，锐意进取，起榜样作用，为我们树立良好形象。　　、工作认真，积极勤奋，进步很快。在短时间内掌握工作要点，在内勤中起了榜样作用。　　、良好的个人形象和素养，专业技能和业务水平优秀，为公司业务创造更多机会和效益，受公司客户及合作企业好评，为公司创造出较好的企业效益或社会效益；工作认真负责，积极主动，服从整体安排，爱岗敬业，乐于助人，与同事相处融洽，业务知识扎实，业务水平优秀，能带动东区的给为同事积极工作，胜任东区大区经理工作；工作出色，业务熟悉，为我们成立起榜样。　　、XXX在我司工作期间，严格遵守我司的各种规章制度，积极主动向同事请教工作的各种知识，服从安排，踏实肯干，开拓视野，丰富了工作经验，为我司创造了更多的价值。望在以后的工作学习中更加的努力。　　、这位同事平时工作认真，有高效率、高质量的工作表现，且在日常生活中能与其他同事团结友爱，互助进取。　　、该员工自进厂以来，工作态度认真，服从安排，表现良好，关心和团结同事。自今年提升保全职位后，表现尤为突出，工作积极，努力学习技术，进步很快，把本人的责任区域管理得井井有条，是员工学习的好榜样。　　、努力工作，服务态度很好，使经理没有后顾之忧在XXXXX，工作积极，热情周到的，有一定的领导能力、专业技能水平杰出的企业、商业水平也在不断提高，关心每一个信，我们学习的榜样，胜任他的工作，热爱他们的工作，乐于助人，和她的同事们，根据布局，在他自己的认真工作，锐意进取，榜样作用，为我们树立了良好的企业形象。　　、勤奋务实，善于学习，对自己的工作认真负责，注重个人成长，工作成绩优异，销售发展迅速，或提高他们的工作方式，从而在工作中收到了良好的效果；了解强，能很快适应新的岗位，在一个新的业务领域可以立即工作，可以随时根据工作需要调整他们的工作方法和正确的精神状态，不断反思，注重个人成长；在业余时间精专的业务知识，提高工作能力；了解高，工作认真勤奋、吃苦耐劳，进步很快，这出新戏一个成功的榜样。　　、办事方法有改进，工作有进步，这位同事做事情踏踏实实、做人本分，能够虚心接受市场招商经理的建议，努力学习不足之处；大力开发所负责区域的空白品种，并积极和经理进行各种环节的沟通；在XX年X月份进步异常迅速；对待工作兢兢业业，处处为公司考虑，不记个人得失。　　、这位同事工作认真，脚踏实地，关心同事。虽然工作性质繁琐、复杂，但她能平和的对待，处理事情有条不紊，工作总能自觉、认真、细致地完成，受到办公室成员一致好评。工作中她能够站在公司的角度，经常提出合理化建议，为部门的管理出谋策划，是领导的好助手。　　、这位同事在工作上又能十分严谨，认真负责，踏踏实实的完成了本职的工作，自己的工作技能得到了很大提高，明显让我们感觉到了你的进步，经过这一段时间的工作，你的阅历提高了，你的`经验也就提高了，能处理好工作中出现的意外情况，真是可喜可贺的！但是也不要骄傲，要继续完善自己的工作能力，处理紧急情况的能力，成为真正有知识有能力的员工！　　、这位同事作为经理特别助理，工作态度认真负责，能认真完成经理交代的各项任务，并能应对各种突发状况，其工作得到了领导的认可值得各位同事学习。　　、这位同事工作努力、认真，成果显著，工作态度端正并能及时完成工作任务，深受领导好评！　　、良好的个人形象和素养，专业技能或业务水平优秀，为公司业务创造更多机会和效益，受公司客户及合作企业好评，为公司创造出较好的企业效益或社会效益；工作认真负责，积极主动，服从整体安排，爱岗敬业，乐于助人，与同事相处融洽，业务知识扎实，业务水平优秀，能带动东区的给为同事积极工作，胜任东区大区经理工作；工作出色，业务熟悉，为我们成立起榜样。　　、这位同事在工作上勤勤恳恳，任劳任怨，认真负责，工作能力也在学习中不断提高，关心同事，非常值得大家学习。　　、xx同志在工作上勤勤恳恳，在思想上也是严格要求自己，他认真学习遵守公司的各项规定，团结同事，乐观上进，始终保持着严谨认真的工作态度，用他自己的话说：要时刻牢记顺泰文员工的责任和义务，在任何时候都把集体的利益放在第一位。张怀庆被评选为XX年度优秀员工，是公司企业文化精神的熏染，也是他自己努力的结果。这不仅是他个人的荣誉，同时也是整个综合部的光荣。希望张怀庆同志在新的一年里发扬成绩，随着顺泰文的不断发展而提高自己，更加勤奋的工作，争取更大的进步。　　、工作认真刻苦，服务态度非常好，使经理在XXX的时候没有后顾之忧；工作积极，热情周到，有一定的领导能力，专业技能业务水平优秀，业务水平也在不断提高，关心每一位合鑫人，是我们大家学习的榜样；能胜任本职工作，爱岗敬业乐于助人，与同事相处融洽，服从整体安排，对本职工作兢兢业业，锐意进取，起榜样作用，为我们树立良好形象。　　、此同事在工作上勤勤恳恳，任劳任怨，认真负责，业务水平也在学习中不断提高，关心同事，非常值得大家学习，新晋社会如此努力难能可贵。　　、XX同志在我公司工作期间能够严格遵守并执行公司的各项规章制度，能够积极主动的配合其他相邻工作同仁协调完成各种工作任务。认真学习业务知识，在很短的时间内就掌握了工作的要点和技巧，并将其合理的运用到工作中去。能够积极主动的向老员工学习，弥补自己的不足。工作积极主动，学习认真，尊敬他人，待人诚恳，能够做到服从指挥，团结同事，不怕苦，不怕累。并能够灵活运用所学的知识解决工作中遇到的实际困难。在工作期间得到领导和同事们的一致好评。　　、这位同事工作认真负责，积极主动，能完全胜任本职工作，爱岗敬业，乐于助人，与同事相处融洽，善于合作。　　、这位同事工作努力，成果显著，按时完成工作任务，跟同事相处融洽，且上班的纪律很好，值得各位同事学习。　　、这位同事积极向上，平时工作表现很努力，在工作时能以认真、仔细、负责的心态做好自己的工作，与同事和睦相处。"
        )
    }
}